Enterprise_Serivces/Prod/SilverGroup2/LoyaltyChannel/result1/Iteration1/t8_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/channel/loyalty/contracts/2010/05/LoyaltyService/GetMerchandisedProductDetails</wsa:Action><wsa:MessageID>uuid:7db36205-18fa-471b-89d7-a1b6f6e580da</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://loyaltychannelqa1.testgs.pvt/LoyaltyService.svc</wsa:To></soap:Header><soap:Body><GetMerchandisedProductDetails xmlns="http://www.gamestop.com/services/channel/loyalty/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CategoryType xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/11">Physical</CategoryType><SKU xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/11">151137</SKU></request></GetMerchandisedProductDetails></soap:Body></soap:Envelope>